Revit 2027 API
IFCParameterTemplate.ExportPropertySetupToFile Method
 Exports mapping information of the provided property setup to a text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExportPropertySetupToFile(
	PropertySetupType propertySetupType,
	string fileName
)
Public Sub ExportPropertySetupToFile (
	propertySetupType As PropertySetupType,
	fileName As String
)
public:
void ExportPropertySetupToFile(
	PropertySetupType propertySetupType,
	String^ fileName
)
member ExportPropertySetupToFile :
        propertySetupType : PropertySetupType *
        fileName : string -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
fileName String
 The full text file name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
FileAccessException |  Failed to access the text file.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace